src/Catalogs/Дети/Дети.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Дети</name>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Родители</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Дети/ObjectModule.bsl
Процедура ПервоеСлово() Экспорт
	
	Сообщить("Привет, Мама! я родился " + ДатаРождения);

КонецПроцедуры
 

Процедура ЗаполнитьДанные() Экспорт

	Наименование = "Вася";
	ДатаРождения = '20000101';

	СтрокаТЧ = Родители.Добавить();
	СтрокаТЧ.ФИО = "Иванова Алена Юрьевна";
	
	СтрокаТЧ = Родители.Добавить();
	СтрокаТЧ.ФИО = "Иванов Сергей Петрович";
	
КонецПроцедуры
